Revit 2027 API
Curve.CreateReversed Method
 Creates a new curve with the opposite orientation of the existing curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve CreateReversed()
Public Function CreateReversed As Curve
public:
Curve^ CreateReversed()
member CreateReversed : unit -> Curve
Return Value
Curve
 The new curve.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace